/**
 * 换乘图标
 *  
 * @author Aphrodite281 QQ: 3435494979
 */

/**
 * 绘制图标
 * @param {Canvas} ctx 被包裹的 Graphics2D 上下文
 */
function hc (ctx) {
    // #layer1
        
    // #path1
    ctx.beginPath();
    ctx.fillStyle = 'rgb(255, 255, 255)';
    ctx.strokeStyle = 'rgb(0, 0, 0)';
    ctx.lineWidth = 3;
    ctx.moveTo(48.987701, 26.458332);
    ctx.bezierCurveTo(48.987701, 32.433493, 46.614078, 38.163927, 42.389001, 42.389004);
    ctx.bezierCurveTo(38.163924, 46.614081, 32.433491, 48.987705, 26.458330, 48.987705);
    ctx.bezierCurveTo(20.483169, 48.987705, 14.752736, 46.614081, 10.527659, 42.389004);
    ctx.bezierCurveTo(6.302582, 38.163927, 3.928959, 32.433493, 3.928959, 26.458332);
    ctx.bezierCurveTo(3.928959, 20.483171, 6.302582, 14.752736, 10.527659, 10.527659);
    ctx.bezierCurveTo(14.752736, 6.302582, 20.483169, 3.928959, 26.458330, 3.928959);
    ctx.bezierCurveTo(32.433491, 3.928959, 38.163924, 6.302582, 42.389001, 10.527659);
    ctx.bezierCurveTo(46.614078, 14.752736, 48.987701, 20.483171, 48.987701, 26.458332);
    ctx.closePath();
    ctx.fill();
    ctx.stroke();

    // #path2
    ctx.beginPath();
    ctx.fillStyle = 'rgb(0, 0, 0)';
    ctx.lineWidth = 0.152681;
    ctx.moveTo(28.143391, 8.466666);
    ctx.bezierCurveTo(16.101511, 9.864169, 12.997440, 16.758378, 12.587755, 27.553896);
    ctx.bezierCurveTo(9.809654, 27.611736, 7.143750, 27.553896, 7.143750, 27.553896);
    ctx.lineTo(14.917791, 33.300273);
    ctx.lineTo(22.691830, 27.553896);
    ctx.bezierCurveTo(22.691830, 27.553896, 19.374967, 27.472496, 17.247702, 27.553892);
    ctx.bezierCurveTo(17.087879, 22.042183, 16.894490, 12.556892, 28.310416, 10.047658);
    ctx.bezierCurveTo(28.153162, 8.903429, 28.189999, 8.951557, 28.143391, 8.466666);
    ctx.closePath();
    ctx.fill();

    // #path2-9
    ctx.beginPath();
    ctx.fillStyle = 'rgb(0, 0, 0)';
    ctx.lineWidth = 0.152681;
    ctx.moveTo(24.773274, 44.449999);
    ctx.bezierCurveTo(36.815154, 43.052497, 39.919225, 36.158287, 40.328910, 25.362769);
    ctx.bezierCurveTo(43.107011, 25.304929, 45.772915, 25.362769, 45.772915, 25.362769);
    ctx.lineTo(37.998874, 19.616392);
    ctx.lineTo(30.224835, 25.362769);
    ctx.bezierCurveTo(30.224835, 25.362769, 33.541698, 25.444169, 35.668963, 25.362773);
    ctx.bezierCurveTo(35.828786, 30.874482, 36.022175, 40.359774, 24.606249, 42.869008);
    ctx.bezierCurveTo(24.763503, 44.013237, 24.726666, 43.965109, 24.773274, 44.449999);
    ctx.closePath();
    ctx.fill();
}